# ExportLayerInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo Constructor
ExportLayerInfo Class See Also
---
Constructs a new ExportLayerInfo with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLayerInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLayerInfo()
```

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace